---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.AnalyticalLinkNotConnected
source: html/b9ae97ee-53db-c763-7488-3bfe764c8c09.htm
---
# Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.AnalyticalLinkNotConnected Property

Analytical Link has lost one or more references.

## Syntax (C#)
```csharp
public static FailureDefinitionId AnalyticalLinkNotConnected { get; }
```